solvers/icoLagrangianFoam/tut/wavyChannel/0/turb/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.00325;

boundaryField
{
    fixedWalls
    {
        type            kqRWallFunction;
        value           uniform 0.00325;
    }
    rotatingWall
    {
        type            kqRWallFunction;
        value           uniform 0.00325;
    }
    in
    {
        type            fixedValue;
        value           uniform 0.0001;
    }
    out
    {
        type            inletOutlet;
        inletValue      uniform 0.00325;
        value           uniform 0.00325;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
